/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "1";
"version-sig"	= "PL-070918";

"common-controls-restart"		= "Uruchom ponownie";
"common-controls-shutdown"		= "Wyłącz";
"common-controls-continue"		= "Dalej";

"common-tab-apple-title"		= "O programie ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Testy sprzętu ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Profil sprzętu ";	// does look better with spaces at head and tail
"common-version-str"			= "Wersja ";
"common-bundle-str"				= "Pakiet ";

"mark-graphics-unknown-str"		= "Wideo nieznane";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Zainstalowane";
"mark-generic-absent-str"		= "Nie znaleziono";
"mark-generic-hasDevice-str"	= "Podłączone urządzenie";
"mark-generic-hasNoDevice-str"	= "Brak podłączonych urządzeń";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "Hertz";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "bajt";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bit";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "Volt";


"units-hour-str"		= " godz. ";
"units-hours-str"		= " godz. ";
"units-min-str"			= " min ";
"units-mins-str"		= " min. ";
"units-sec-str"			= " sek.";
"units-secs-str"		= " sek.";

"units-kilo-str"		= "k";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= "; ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ",";
"delim-thousds-str"		= "; ";
"delim-space-str"		= " ";
"delim-pct-str"			= "%";

"notcompat-nosupport-str"		= "Apple Hardware Test nie obsługuje tego komputera.";
"notcompat-ownrisk-str"			= "Kontynuuj na własne ryzyko [wersja przedpremierowa].";


"test-head-intro1-text"			= "Program Apple Hardware Test może wykonywać testy sprzętowe twojego Macintosha.";
"test-head-intro2-text"			= "Aby przeprowadzić testy, kliknij w przycisk „Testuj” lub wciśnij literę „T”.";

"test-probe-onto-text"			= "Sprawdzam twój komputer; to może potrwać minutę...";
"test-probe-outof-text"			= "Sprawdzanie komputera zakończone.";

"test-controls-launch"			= "Testuj";
"test-controls-interrupt"		= "Zatrzymaj testy";

"test-choices-title"			= "Wybór testów";
"test-about-title"				= "Opis testów i wyników";
"test-results-title"			= "Wyniki testów";

"test-results-notestyet"		= "Nie można uruchomić testów, dopóki nie zakończy się sprawdzanie komputera.";
"test-results-nodevfound"		= "Nie znaleziono urządzeń.";
"test-results-notyet"			= "Gotów do testów.";
"test-results-quick-ongoing"	= "Trwające testy.";
"test-results-extend-ongoing"	= "Trwają testy rozszerzone.";
"test-results-willstop"			= "Testy będą zatrzymane.";
"test-results-interrupted"		= "Testy nie zostały zakończone.";
"test-results-nofail"			= "Nie znaleziono problemów.";
"test-results-error"			= "Błąd wewnętrzny podczas testu.";
"test-results-failed"			= "Uwaga!  Program Apple Hardware Test wykrył błąd.";

"test-ongoing-short-status"		= "Trwające testy.";
"test-ongoing-mlb-status"		= "Testowanie głównej płyty logicznej.";
"test-ongoing-memory-status"	= "Testowanie pamięci.";
"test-ongoing-storage-status"	= "Testowanie pamięci masowej.";
"test-ongoing-video-status"		= "Testowanie grafiki.";

"test-ongoing-pass-time-text"	= " do testu...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "do testu...";
"test-ongoing-sess-pass-text"	= "Numer przebiegu: ";
"test-ongoing-sess-time-text"	= "Łączny czas testu: ";

"test-desc-initial-1-text"	= "Apple Hardware Test jest narzędziem diagnostycznym do wykrywania problemów sprzętowych komponentów komputera.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "Wykonane testy określą, czy występujące problemy mają podłoże sprzętowe, czy programowe.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "Jeśli wyniki testów wykażą brak problemów sprzętowych, prosimy zapoznać się z podręcznikiem obsługi i/lub systemem pomocy dostarczonym razem z komputerem.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Przybliżony czas do zakończenia: 3 minuty lub dłużej, w zależności od ilości zainstalowanej pamięci.";	/* default */
"test-desc-intro-quick-text2"	= "Przybliżony czas do zakończenia: 10 do 15 sekund lub dłużej, w zależności od ilości zainstalowanej pamięci.";
"test-desc-intro-quick-text3"	= "Przybliżony czas do zakończenia: 2 minuty lub dłużej, w zależności od ilości zainstalowanej pamięci.";
"test-desc-intro-quick-text4"	= "Przybliżony czas do zakończenia: 4 minuty lub dłużej, w zależności od ilości zainstalowanej pamięci.";

"test-desc-intro-extend-text"	= "Przybliżony czas do zakończenia: 1 godzina lub dłużej, w zależności od ilości zainstalowanej pamięci.";	/* default */
"test-desc-intro-extend-text2"	= "Przybliżony czas do zakończenia: 10 do 15 minut lub dłużej, w zależności od ilości zainstalowanej pamięci.";
"test-desc-intro-extend-text3"	= "Przybliżony czas do zakończenia: 30 minut lub dłużej, w zależności od ilości zainstalowanej pamięci.";
"test-desc-intro-extend-text4"	= "Przybliżony czas do zakończenia: 2 godziny lub dłużej, w zależności od ilości zainstalowanej pamięci.";

"test-desc-option-extend-text"	= "Wykonaj testy rozszerzone (trwają znacznie dłużej).";
"test-desc-option-loop-text"	= "Wykonywanie w pętli włączone.";

"test-desc-quick-running-1-text"	= "Trwają testy...";
"test-desc-quick-running-2-text"	= "Aby zatrzymać, kliknij w przycisk „Zatrzymaj testy”.";
"test-desc-quick-running-3-text"	= "Lub wciśnij jednocześnie klawisze „command” („Apple”) oraz „.” (kropka).";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Trwają testy rozszerzone...";
"test-desc-extend-running-2-text"	= "Aby zatrzymać, kliknij w przycisk „Zatrzymaj testy”.";
"test-desc-extend-running-3-text"	= "Lub wciśnij jednocześnie klawisze „command” („Apple”) oraz „.” (kropka).";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Uwaga!  Program Apple Hardware Test wykrył błąd.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "Najpierw zanotuj kod błędu, jaki pojawił się w polu wyników testów.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Następnie, jeśli do komputera dołączone są urządzenia peryferyjne, wyłącz komputer, odłącz te urządzenia i uruchom Test rozszerzony, aby zweryfikować te wyniki.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Następnie, jeśli błąd nadal będzie zgłaszany, dowiedz się z materiałów serwisowych dołączonych do komputera, jak skontaktować się z działem AppleCare po dalszą pomoc.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Uwaga!  Program Apple Hardware Test napotkał problemy podczas uruchomienia.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "Najpierw zanotuj kody błędów, jakie pojawią się w obszarze wyników testów.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Następnie, jeśli do komputera dołączone są urządzenia peryferyjne, wyłącz komputer, odłącz te urządzenia i uruchom Test rozszerzony, aby zweryfikować te wyniki.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Następnie, jeśli błąd nadal będzie zgłaszany, dowiedz się z materiałów serwisowych dołączonych do komputera, jak skontaktować się z działem AppleCare po dalszą pomoc.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Produkt";
"prof-prod-group-subtitle"		= "Szczegóły produktu:";
"prof-prod-name-label"			= "Nazwa Macintosha:";
"prof-prod-model-label"			= "Model Macintosha:";
"prof-prod-cputype-label"		= "Typ CPU:";
"prof-prod-cpucount-label"		= "Liczba procesorów:";
"prof-prod-cpucoretotal-label"	= "Łączna liczba rdzeni:";
"prof-prod-cpucorecount-label"	= "Liczba rdzeni:";
"prof-prod-cpuspeed-label"		= "Szybkość CPU:";
"prof-prod-cpucache-label"		= "Pamięć podręczna L2 CPU (na procesor):";

"prof-prod-L2cache-label"		= "Pamięć podręczna L2:";
"prof-prod-L2cachecore-label"	= "Pamięć podręczna L2 (na rdzeń):";
"prof-prod-L3cache-label"		= "Pamięć podręczna L3:";

"prof-prod-cpucache3-label"		= "Pamięć podręczna L3 (na procesor):";
"prof-prod-mlb-sn-label"		= "Nr. seryjny MLB:";
"prof-processor-tray-sn-label"	= "Nr seryjny szuflady procesorów:";

"prof-graph-group-title"		= "Wideo";
"prof-graph-group-subtitle"		= "Szczegóły wideo:";
"prof-graph-chipset-label"		= "Grafika :";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Szerokość ekranu (piksele):";
"prof-graph-disp-height-label"	= "Wysokość ekranu (piksele):";

"prof-communi-group-title"		= "Komunikacja";
"prof-communi-group-subtitle"	= "Szczegóły komunikacji:";
"prof-communi-enet-mac-label"	= "Adres MAC Ethernet:";
"prof-communi-fwire-mac-label"	= "Adres MAC FireWire:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "Odbiornik IR:";
"prof-communi-usb1-connect-label"	= "Port USB 1:";
"prof-communi-usb2-connect-label"	= "Port USB 2:";
"prof-communi-usb3-connect-label"	= "Port USB 3:";
"prof-communi-usb4-connect-label"	= "Port USB 4:";

"prof-memo-group-title"			= "Pamięć";
"prof-memo-group-subtitle"		= "Szczegóły pamięci:";
"prof-memo-overview-label"		= "Przegląd";
"prof-memo-slot-1-label"		= "Pamięć nr 1";
"prof-memo-slot-2-label"		= "Pamięć nr 2";
"prof-memo-slot-3-label"		= "Pamięć nr 3";
"prof-memo-slot-4-label"		= "Pamięć nr 4";
"prof-memo-slot-5-label"		= "Pamięć nr 5";
"prof-memo-slot-6-label"		= "Pamięć nr 6";
"prof-memo-slot-7-label"		= "Pamięć nr 7";
"prof-memo-slot-8-label"		= "Pamięć nr 8";

"prof-memo-type-str"			= "Fabryczne SDRAM na płycie.";
"prof-memo--str"				= "nieznany";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Czas cyklu (ns)";
"prof-memo-ct2-str"				= " Cykl (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Poprawka";
"prof-memo-paired-str"			= "Połączone w pary z #";
"prof-memo-paired-not-str"		= " osobne";
"prof-memo-mismatch-label"		= "Niezgodność:";
"prof-memo-size-str"			= " rozmiar";
"prof-memo-speed-str"			= " szybkość";
"prof-memo-vendor-str"			= " producent";
"prof-memo-recommend-str"		= "Zalecane: ";
"prof-memo-post-fail-str"		= "Błąd POST";

"prof-board-group-title"		= "Płyta logiczna";
"prof-board-brom-vers-label"	= "Wersja Boot ROM:";
"prof-board-smc-vers-label"		= "Wersja SMC:";
"prof-board-syst-sn-label"		= "Numer seryjny systemu:";
"prof-board-bootdev-label"		= "Domyślne urządzenie startowe:";

"prof-stor-group-title"			= "Pamięć masowa";
"prof-stor-size-label"			= "Wielkość:";

"prof-powr-group-title"			= "Zasilanie";
"prof-powr-group-subtitle"		= "Szczegóły zasilania:";
"prof-powr-src-label"			= "Źródło zasilania:";
"prof-powr-src-wall-str"		= "Zasilacz";
"prof-powr-src-batt-str"		= "Baterie";
"prof-powr-ac-on-str"			= "Połączony";
"prof-powr-ac-off-str"			= "Nie jest połączony";
"prof-powr-capac-label"			= "Pojemność:";
"prof-powr-volt-label"			= "Napięcie:";
"prof-powr-status-label"		= "Status:";

